/*
 *  Приведення до булю на прикладі Boolean(value)
 */


// 0
// ''
// undefined
// null
// NaN
// false
// console.log(Boolean());

/*
 * Логічне І (оператор &&)
 * - Запинається на брехні
 * - Повертає те на чому запнулось або останній операнд
 */

// console.log(212 && '5');
            
/*
 * Логічне АБО (оператор ||)
 * - Запинаєтьс на правді
 * - Повертає те на чому запнулось або останній операнд
 */


console.log(false || '0' || 0);


/*
 * Логічне НІ (оператор !)
 * Робить інверсію правда > брехня та брехня > правда
 */

!true//false
!false//true

