/**
 * У кожного рядка є вбудовані властивості і методи, розглянемо деякі з них.
    length — властивість, зберігає довжину рядка
    toLowerCase() і toUpperCase() — повернуть новий рядок у відповідному регістрі, не змінюють оригінальний рядок
    indexOf() — поверне позицію (індекс) на якій знаходиться перший збіг підрядка або -1, якщо нічого не знайдено
    includes() — один з найбільш часто використовуваних методів, в більшості випадків замінює indexOf, перевіряє чи входить підрядок в рядок, повертає true або false
    str.startsWith() та str.endsWith() перевіряють, чи починається і чи закінчується рядок певним підрядком.
    trim() — видаляє (“обрізає”) пробіли з початку та кінця рядка.
    padStart() і padEnd()доповнює поточний рядок іншим рядком (кілька разів, якщо потрібно), доки отриманий рядок не досягне заданої довжини. 
        Відступ застосовується з кінця/початку поточного рядка.
 */
/*
 * Довжина рядка, влістивість length
 */
const message = 'В цьому рядку 26 символів.';


/*
 * Конкатенація рядків
 */

// const firstName = ;
// const lastName = ;
// const fullname = ;




/*
 * Напиши скрипт який виведе рядок в форматі:
 * «Гість x y поселяється в g номер q»,
 * підставив замість x y g q значення змінних
 */
const firstName = 'Mango';
const lastName = 'Lee';
const room = 716;
const type = 'VIP';
const customersMsg = 'Гість a b заселяється в v номер h';



/*
 * Шаблонні рядки (template strings)
 * Повертаємось до складання рядка поселення в готель
 */

const quantity = 5;
const orderMsg = 'Ви замовляєте s тістечок.';



/*
 * Нормалізація з методом toLocaleLowerCase()
 */




/*
 * Пошук в рядку з методом includes()
 */


const blacklistedWord1 = 'спам';
const blacklistedWord2 = 'розпродаж';

const string1 = 'Привіт, я Марк Цукерберг, це не спам, пропоную тобі мільйон!';
const string2 = 'Найбільший РОЗПРОДАЖ цього тижня, не пропустіть!';
const string3 = 'Рекламна кампанія #jsIsAwesome';

