/*
 * Напиши скрипт вибору готеля по кількості зірок.
 * 1,2 - 20$,  3,4 - 50$,  5 - 120$
 *
 * Якщо в змінній stars щось окрім чисел 1-5, виведи рядок
 * 'Токої кількості зірок немає'
 */

const stars = 4;
let price;



/*
 * Напиши скрипт вибору опції доставки товару.
 * Опція зберігається в змінній option: 1 - самовивоз, 2 - кур"єр, 3 - пошта
 *
 * В змінну message записати повідомлення в залежності від опції.
 * - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
 * - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
 * - 'Посилка буде відправлена сьогодні'
 * - 'Вам передзвонит менеджер'
 */

// 1 створюємо змінні
const option = 5;
let message = '';

// 2. робимо світч
// 3. перевіряємо на рівність опцію і виводимо повідоилення
// switch (option) {
//     case 1:      
//         message = 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
//         console.log(message);
//         break;
//     case 2:
//         message = 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
//         console.log(message);
//         break;
//     case 3:
//         message = 'Посилка буде відправлена сьогодні';
//         console.log(message);
//         break;
// // 4. дефолтне повідомлення
//     default:
//         message = 'Вам передзвонит менеджер';
//         console.log(message);
//         break;
// }