
/*
 * Оператори порівняння
 */

console.log(10 % 4);
// console.log(15 > 3);

/*
 * Приведення (перетворення) типів до числа
 */

// console.log('10' > 5);

/*
 * Оператори рівності (== и ===) та нерівності (!= и !==)
 * ✅ «ЗАВЖДИ ВИКОРИСТОВУЙТЕ СУВОРУ РІВНІСТЬ (===) ТА НЕРІВНІСТЬ (!==)»
 */


// console.log(5 === '5');


/**
 * 4. Що буде в консолі
            const isEqual = 0 == false; 
            const isEqual = 0 !== false; 
            const isEqual = '12' == 12; 
            const isEqual = '12' === 12; 
 */

