/*
 * Нормалізація з методом toLocaleLowerCase() і trim()
 */


/*
 * Пошук в рядку з методом includes()
 */


const blacklistedWord1 = 'спам';
const blacklistedWord2 = 'розпродаж';

const string1 = 'Привіт, я Марк Цукерберг, це не спам, пропоную тобі мільйон!';
const string2 = 'Найбільший РОЗПРОДАЖ цього тижня, не пропустіть!';
const string3 = 'Рекламна кампанія #jsIsAwesome';

//Додаткові
/**
 * Створити змінну, яка містить рядок з вашим ім'ям та прізвищем. Використовуючи метод .length, 
 * вивести в консоль кількість символів у рядку.
 * Створити змінну, яка містить рядок з вашим ім'ям. Використовуючи метод .toUpperCase(), 
 * перетворити рядок у верхній регістр та вивести результат в консоль.
 * Створити змінну, яка містить рядок з вашим ім'ям. Використовуючи метод .charAt(), вивести перший 
 * символ вашого імені в консоль.
 * Створити змінну, яка містить рядок з вашим ім'ям та прізвищем. Використовуючи метод .indexOf(), 
 * знайти і вивести в консоль позицію, на якій знаходиться пробіл між ім'ям та прізвищем.
 * Створити змінну, яка містить рядок з вашим ім'ям. Використовуючи метод .replace(), замінити першу 
 * літеру вашого імені на символ "@" та вивести результат в консоль.
 * Створити змінну, яка містить рядок зі словом "JavaScript". Використовуючи метод .substring(), 
 * вивести підстроку, яка містить перші 4 символи слова "Java".
 */

//Творчі
/**
 * Створи змінну яка буде зберігати рядок “Ваш баланс поповнено на 1”. Додай в кінець рядка довільну кількість нулів. Довжину рядка дізнайся за допомогою властивості.
 */

// Супер творчі
/**
 * Створити разом з учнями скрипт, який буде отримувати від користувача число (кількість хвилин) і буде виводити рядок в форматі часу як результат. Наприклад 80 виведе 01:20 450 - 07:30. Можете використати наступні формули
        const numberHours = отримане число / 60;
        const days = Math.floor(numberHours / 24);
        const hours = Math.floor(numberHours % 60);
        const modHours = String(hours).padStart(2, 0);
        const minutes = отримане число % 60;
        const modMinutes = String(minutes).padStart(2, 0); 
*/