// 1. Вивести в консоль числа від 1 до 5 всіма циклами

// 2. Написати скрипт який буде перевіряти середній бал успішності учня.
// Прервати роботу циклу, коли середній бал буде меньше 7.

// 3. Виведіть в консоль всі непарні числа за допомогою циклу for

// 4. Напиши цикл, який пропонує в prompt ввести число, більше 100. 
// Якщо відвідувач ввів інше число – попросити ввести ще раз и т.д.
// Цикл повинен питати число поки відвідувач не введе число, більше 100, або 
// не натисне кнопку Відміна (ESC).

/*
* ЗАВДАННЯ 5
* Напиши скрипт який просить відвідувача ввести число в prompt до тих пір, поки відвідувач не натисне 
* Cancel і кожен раз додає введене значення до загальної суми.
* При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення додається до 
* значення змінної total.
* Операція введення числа триває до тих пір, поки користувач не натисне кнопку Cancel в prompt.
* Після того як користувач припинив введення натиснувши кнопку Cancel, показати alert з рядком 
* 'Загальна сума чисел дорівнює [сума]'.
* 🔔 Робити перевірку того, що користувач ввів саме число, а не довільний набір символів, не потрібно. 
* Якщо хочеш, в разі некоректного введення, показуй alert з текстом 'Було написано не число, спробуйте 
* ще раз', при цьому результат prompt плюсувати до загальної суми не потрібно, після чого знову 
* користувачеві пропонується ввести число в prompt.
* */

let input;
let total;

