/**
 * 
 * 1. Використовуючи if..else, напишіть код, що отримує число з 
 * prompt і потім виводить повідомлення на екран:

            1, якщо значення більше нуля,
            -1, якщо меньше нуля,
            0, якщо дорівнює нулю.
    2. Перепишіть конструкцію if, використовуючи умовний оператор '?':
            let result;
            if (a + b < 4) {
            result = 'Нижче';
            } else {
            result = 'Вище';
            }
3. Творчі завдання
    1. Напиши скрипт входження числа у відрізок зазначений в х1 та х2.
            до х1
            після х1
            від х1 до х2
            до х1 або після х2
            const x1 = 10;
            const x2 = 30;
            const number = 45;
    2. Напиши скрипт який перевіряє можливість відкрити чат з користувачем. 
    Для цього користувач має бути:
                другом
                онлайн
                без режиму не турбувати
        const isOnline = false;
        const isFriend = true;
        const isDnd = false;

    3. Напишіть код з використанням switch, що відповідає наступній конструкції if..else. 
    Результат виведіть на екран:
            let message;
            if(browser == 'Edge') {
            message = "You've got the Edge!";
            } else if (browser == 'Chrome'
            || browser == 'Firefox'
            || browser == 'Safari'
            || browser == 'Opera') {
            message = 'Ми підтримуємо і ці браузери' ;
            } else {
            message =  'Маємо надію, що ця сторінка виглядає добре!' ;
            }

    4. Перепишіть код нижче використовуючи одну конструкцію switch. 
    Результат виведіть на екран. Данні отримайте з prompt:
        let a = значення prompt;
        if (a === 0) {
        message = 0;
        }
        if (a === 1) {
        message = 1;
        }

        if (a === 2 || a === 3) {
        message = '2,3';
        }

    5. Що буде в консолі 

            const b = 10;

            if (true) {
                const a = 5;
                console.log(a);
                console.log(b);
            }
            console.log(a);

            if (true) {
            const b = 10;

            console.log(a);
            console.log(b);
            }

            console.log(b);

3. Творчі завдання
    1. Написати програму яка перевіряє чи введене число через prompt потрапляє в діапазон 
    від 55 до 99 включно. Якщо так, вивести на екран "Число потрапляє в діапазон". 
    Якщо ні, вивести "Число не потрапляє в діапазон".
    
    2. Є 3 вікові групи : діти (0-16), дорослі(17-60), пенсіонери (61-100). До якої групи 
    відноситься Максим, якщо йому 55 років. Назву групи вивести на екран.
    Якщо ваше ім’я містить більше 4 букв і прізвище більше 5, то виведіть на екран число,
    яке дорівнює сумі букв імені і прізвища. Якщо умова не виконується - вивести “УПС”. 
        Наприклад: “Віктор Сташко” Віктор - 6 літер, Сташко - 6 літер. Виводимо 12. Використовувати 
        вбудований метод length.
    
    3. Виберіть будь-яке число від 1 до 5 включно через функцію random. За допомогою if else 
    визначіть, що це за число.
    
    4. Змінна lang може приймати 4 значення: 'ua', 'en', 'ru', 'fr'. За допомогою конструкції switch виведи на екран назву місяця в залежності від обраної мови. Наприклад, якщо lang = 'fr', то в консоль виводимо "Janvier".
    5. Супертворчі завдання
                Напиши скрипт вибору опції доставки товару. Опція зберігається в змінній option: 
                1 - самовивіз, 2 - кур"єр, 3 - пошта. В змінну message записати повідомлення в залежності від опції.
                - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
                - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
                            - 'Посилка буде відправлена сьогодні'
                            - 'Вам передзвонит менеджер'.

 */

// 2. Напиши скрипт який перевіряє можливість відкрити чат з користувачем. 
// Для цього користувач має бути:
//             другом
//             онлайн
//             без режиму не турбувати
   
const isOnline = false;
const isFriend = true;
const isDnd = false;

const canOpenChat = isFriend && isOnline && !isDnd

// console.log('Чи має доступ до чату користувач: ', canOpenChat);

const b = 10;

if (true) {
    const a = 5;
    console.log(a);//5
    console.log(b);//10
}
console.log(a);//error

if (true) {
const b = 10;

console.log(a);//
console.log(b);//
}

console.log(b);//