/**
 * 2. Додаткові завдання
        1. Створіть змінні a1, a2, a3, a4, a5 . За допомогою математичних операторів (додавання, віднімання і т.д.) знайдіть значення виразів: 5 + 3;  5 - 3;  5 * 3;  5/3, помістивши результат кожного виразу в змінну. Наприклад, let a1 = 5 + 3. Вивести в консоль всі змінні по черзі.
        2. Створіть змінні a6, a7, a8, a9, a10. Помістіть в них результат виразів: 5 % 3; 3 % 5; 5 + '3'; '5' - 3;  75 + 'кг' і виведіть на екран за допомогою alert по черзі всі змінні.
        3. Напишіть скрипт для створення випадкового числа з плаваючою крапкою від min до max (не враховуючи max).
        4. Створіть функцію яка генерує випадкове ціле число від min до max включно.
        5. Напишіть скрипт, який просить відвідувача ввести два числа, і в результаті показує їх суму.
    3. Творчі завдання
        1. Створити змінні к1… к4 , в них почергово записати ТІЛЬКИ результат приведення до ЦІЛОГО ЧИСЛА з даних : 1) 5px; 2) 12djd334; 3) 12.45asdwe12; 4) qwqweeewq;
        2. Створити змінні к1… к4 , в них почергово записати ТІЛЬКИ результат приведення до ДРОБОВОГО ЧИСЛА з даних : 1) 5px; 2) 12djd334; 3) 12.45asdwe12; 4) qwqweeewq;
        3. За допомогою об’єкту Math виведіть в консоль найбільше і найменше значення серед заданих (2, 34, 99, 3, 22, 36, 733, 18)
        4. У змінну random згенеруйте випадкове число від 3 до 19 включно. Результат виведіть в консоль
    4. Супертворчі завдання
        1. Напишіть скрипт, який знаходить площу прямокутника. Висота 23см, шириною 10см — всі данні повинні зберігатися в змінних.  Значення площі повинно зберігається в числовій змінній.
        2. Напишіть скрипт, який знаходить обсяг циліндра висотою 10м і діаметром основи 4м , результат та дані повинні зберігатися в змінних.
        3. У прямокутного трикутника дві сторони зі значенням 3 і 4. Знайдіть гіпотенузу k по теоремі Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор піднесення до степеня **). Результат та дані повинні зберігатися в змінних.
        
 */