/**
 * 1. Напишіть функцію sum, яка приймає два аргументи та повертає їх суму.
 * 2. Напишіть функцію greet, яка приймає ім'я як аргумент та повертає рядок 
 * "Hello, [ім'я]".
 * 3. Напишіть функцію isEven, яка приймає число та повертає true, якщо воно 
 * парне, і false - якщо непарне.
 * 4. Напишіть функцію squareArray, яка приймає масив чисел та повертає новий  
 * масив, де кожен елемент є квадратом відповідного елемента вхідного масиву.
 * const numbers = [5, 12, 8, 20, 15, 7, 10, 3, 18, 25];
 * 5. Створіть об'єкт person з властивостями name, age та методом introduce, 
 * який повертає рядок "My name is [name] and I am [age] years old".
 * 6. Напишіть функцію isAdult, яка приймає об'єкт person та повертає true, 
 * якщо вік більше або дорівнює 18, і false - якщо менше.
 * 7. Напишіть функцію cloneObject, яка приймає об'єкт та повертає його клон.Використайте розпилення.
 * 8. Напишіть функцію findMax, яка приймає масив чисел та повертає найбільше число в масиві.
 * 9. Напишіть функцію filterEvens, яка приймає масив чисел та повертає новий масив, що містить тільки парні числа.
 * 10. Напишіть функцію sumArray, яка приймає масив чисел та повертає суму всіх елементів масиву.(reduce)
 * 11. Створіть кнопку, яка при натисканні змінює текст параграфа на "Button clicked!".
 * 12. Створіть форму з текстовим полем та кнопкою. При натисканні на кнопку виведіть значення текстового поля в консоль.
 */